In [1]:
import pandas as pd
import numpy as np

In [2]:
#pandas always takes dictnary value

In [3]:
dict1 = {
       "name":['Mayank', 'Ambuj', 'Abhay'],
       "marks":[100,33,65],
       "city":['Agra','khasganj','Balia']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

     name  marks      city
0  Mayank    100      Agra
1   Ambuj     33  khasganj
2   Abhay     65     Balia

In [7]:
df.to_csv('roommate.csv')

In [8]:
df.to_csv('roommate_index_false.csv', index = False)

In [11]:
df.head()

     name  marks      city
0  Mayank    100      Agra
1   Ambuj     33  khasganj
2   Abhay     65     Balia

In [12]:
df.head(2)

     name  marks      city
0  Mayank    100      Agra
1   Ambuj     33  khasganj

In [13]:
df.tail(2)

    name  marks      city
1  Ambuj     33  khasganj
2  Abhay     65     Balia

In [14]:
df.describe()

            marks
count    3.000000
mean    66.000000
std     33.511192
min     33.000000
25%     49.000000
50%     65.000000
75%     82.500000
max    100.000000

In [16]:
train_dict = {
    "Train no.":[122,123,124],
    "speed km/hr":[65,66,75],
    "city":['Agra', 'Lucknow' ,'Delhi']
}

In [18]:
train_df = pd.DataFrame(train_dict)

In [19]:
train_df

   Train no.  speed km/hr     city
0        122           65     Agra
1        123           66  Lucknow
2        124           75    Delhi

In [30]:
train_df.to_csv('train.csv',index=False)

In [31]:
train = pd.read_csv('train.csv')

In [32]:
train

   Train no.  speed km/hr     city
0        122           65     Agra
1        123           66  Lucknow
2        124           75    Delhi

In [33]:
train['city']

0       Agra
1    Lucknow
2      Delhi
Name: city, dtype: object

In [40]:
train_df.dtypes

Train no.       int64
speed km/hr     int64
city           object
dtype: object

In [41]:
train['Train no.'][0]

122

In [42]:
train['Train no.'][0]=555

c:\users\this pc\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
train

   Train no.  speed km/hr     city
0        555           65     Agra
1        123           66  Lucknow
2        124           75    Delhi

In [44]:
train.index=['A','B','C']

In [45]:
train

   Train no.  speed km/hr     city
A        555           65     Agra
B        123           66  Lucknow
C        124           75    Delhi

In [46]:
series = pd.Series(np.random.rand(34))

In [48]:
series.head()

0    0.384314
1    0.519555
2    0.188950
3    0.166920
4    0.775447
dtype: float64

In [49]:
type(series)

pandas.core.series.Series

In [50]:
type(train)

pandas.core.frame.DataFrame

In [53]:
newdf= pd.DataFrame(np.random.rand(334,5), index= np.arange(334))

In [55]:
newdf.head(5)

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.093998  0.738085  0.214200  0.797743  0.289570
2  0.647305  0.080058  0.216104  0.016401  0.186018
3  0.096152  0.200071  0.725482  0.648755  0.449355
4  0.288567  0.895077  0.111086  0.994923  0.321657

In [56]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.477313    0.484547    0.473979    0.517277    0.519657
std      0.293468    0.279466    0.281624    0.277762    0.292454
min      0.000592    0.001216    0.010679    0.002679    0.001996
25%      0.211338    0.238014    0.228544    0.287499    0.281081
50%      0.484673    0.487311    0.466028    0.515492    0.502734
75%      0.696402    0.717066    0.704529    0.752303    0.781134
max      0.986796    0.993746    0.995780    0.997522    0.994916

In [57]:
type(newdf)

pandas.core.frame.DataFrame

In [59]:
newdf.shape

(334, 5)

In [60]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [61]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [62]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [63]:
newdf.head(2)

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.093998  0.738085  0.214200  0.797743  0.289570

In [65]:
newdf[0][1]= 0.122322

In [66]:
newdf.head(2)

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [67]:
newdf[0][1]

0.122322

In [69]:
numpy = newdf.to_numpy()

In [70]:
numpy

array([[0.84939865, 0.18888666, 0.46750519, 0.66555784, 0.82998547],
       [0.122322  , 0.73808481, 0.21420025, 0.79774269, 0.28956965],
       [0.64730482, 0.08005842, 0.21610439, 0.016401  , 0.18601832],
       ...,
       [0.61239629, 0.59497768, 0.67396568, 0.9473845 , 0.97519593],
       [0.54835558, 0.9494307 , 0.93359237, 0.20524582, 0.20945308],
       [0.29397307, 0.06709303, 0.7225835 , 0.68044142, 0.85183091]])

In [71]:
type(numpy)

numpy.ndarray

In [72]:
numpy.shape

(334, 5)

In [73]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.849399,0.122322,0.647305,0.096152,0.288567,0.271907,0.605194,0.039239,0.646302,0.527489,...,0.536992,0.799931,0.694572,0.468809,0.722137,0.358630,0.047291,0.612396,0.548356,0.293973
1,0.188887,0.738085,0.080058,0.200071,0.895077,0.658433,0.492445,0.384855,0.184514,0.477194,...,0.936149,0.216273,0.021868,0.275506,0.037625,0.471347,0.233793,0.594978,0.949431,0.067093
2,0.467505,0.214200,0.216104,0.725482,0.111086,0.876293,0.544689,0.158764,0.684085,0.621239,...,0.357012,0.592682,0.755080,0.102290,0.820108,0.175796,0.995780,0.673966,0.933592,0.722584
3,0.665558,0.797743,0.016401,0.648755,0.994923,0.769870,0.718555,0.546594,0.846033,0.345179,...,0.885550,0.328163,0.270780,0.062104,0.487672,0.512075,0.281403,0.947385,0.205246,0.680441
4,0.829985,0.289570,0.186018,0.449355,0.321657,0.903602,0.058614,0.167868,0.177370,0.992706,...,0.672269,0.718177,0.941934,0.855279,0.935319,0.876464,0.932943,0.975196,0.209453,0.851831

In [74]:
newdf

            0         1         2         3         4
0    0.849399  0.188887  0.467505  0.665558  0.829985
1    0.122322  0.738085  0.214200  0.797743  0.289570
2    0.647305  0.080058  0.216104  0.016401  0.186018
3    0.096152  0.200071  0.725482  0.648755  0.449355
4    0.288567  0.895077  0.111086  0.994923  0.321657
..        ...       ...       ...       ...       ...
329  0.358630  0.471347  0.175796  0.512075  0.876464
330  0.047291  0.233793  0.995780  0.281403  0.932943
331  0.612396  0.594978  0.673966  0.947385  0.975196
332  0.548356  0.949431  0.933592  0.205246  0.209453
333  0.293973  0.067093  0.722584  0.680441  0.851831

[334 rows x 5 columns]

In [75]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.829985  0.665558  0.467505  0.188887  0.849399
1    0.289570  0.797743  0.214200  0.738085  0.122322
2    0.186018  0.016401  0.216104  0.080058  0.647305
3    0.449355  0.648755  0.725482  0.200071  0.096152
4    0.321657  0.994923  0.111086  0.895077  0.288567
..        ...       ...       ...       ...       ...
329  0.876464  0.512075  0.175796  0.471347  0.358630
330  0.932943  0.281403  0.995780  0.233793  0.047291
331  0.975196  0.947385  0.673966  0.594978  0.612396
332  0.209453  0.205246  0.933592  0.949431  0.548356
333  0.851831  0.680441  0.722584  0.067093  0.293973

[334 rows x 5 columns]

In [76]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.293973  0.067093  0.722584  0.680441  0.851831
332  0.548356  0.949431  0.933592  0.205246  0.209453
331  0.612396  0.594978  0.673966  0.947385  0.975196
330  0.047291  0.233793  0.995780  0.281403  0.932943
329  0.358630  0.471347  0.175796  0.512075  0.876464
..        ...       ...       ...       ...       ...
4    0.288567  0.895077  0.111086  0.994923  0.321657
3    0.096152  0.200071  0.725482  0.648755  0.449355
2    0.647305  0.080058  0.216104  0.016401  0.186018
1    0.122322  0.738085  0.214200  0.797743  0.289570
0    0.849399  0.188887  0.467505  0.665558  0.829985

[334 rows x 5 columns]

In [77]:
newdf.head()

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570
2  0.647305  0.080058  0.216104  0.016401  0.186018
3  0.096152  0.200071  0.725482  0.648755  0.449355
4  0.288567  0.895077  0.111086  0.994923  0.321657

In [78]:
newdf.sort_index(axis=1,ascending=False,inplace=True)

In [79]:
newdf.head()

          4         3         2         1         0
0  0.829985  0.665558  0.467505  0.188887  0.849399
1  0.289570  0.797743  0.214200  0.738085  0.122322
2  0.186018  0.016401  0.216104  0.080058  0.647305
3  0.449355  0.648755  0.725482  0.200071  0.096152
4  0.321657  0.994923  0.111086  0.895077  0.288567

In [80]:
newdf.sort_index(axis=1,inplace=True)

In [81]:
newdf.head(2)

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [82]:
newdf[0]

0      0.849399
1      0.122322
2      0.647305
3      0.096152
4      0.288567
         ...
329    0.358630
330    0.047291
331    0.612396
332    0.548356
333    0.293973
Name: 0, Length: 334, dtype: float64

In [86]:
check = newdf.set_index(0,drop=True)

In [87]:
check

                 1         2         3         4
0
0.849399  0.188887  0.467505  0.665558  0.829985
0.122322  0.738085  0.214200  0.797743  0.289570
0.647305  0.080058  0.216104  0.016401  0.186018
0.096152  0.200071  0.725482  0.648755  0.449355
0.288567  0.895077  0.111086  0.994923  0.321657
...            ...       ...       ...       ...
0.358630  0.471347  0.175796  0.512075  0.876464
0.047291  0.233793  0.995780  0.281403  0.932943
0.612396  0.594978  0.673966  0.947385  0.975196
0.548356  0.949431  0.933592  0.205246  0.209453
0.293973  0.067093  0.722584  0.680441  0.851831

[334 rows x 4 columns]

In [90]:
check.to_csv("check.csv")

In [91]:
type(newdf)

pandas.core.frame.DataFrame

In [92]:
type(newdf[0])

pandas.core.series.Series

In [93]:
newdf2 = newdf

In [94]:
newdf.head(2)

          0         1         2         3         4
0  0.849399  0.188887  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [95]:
newdf2[1][0]=0.122

In [96]:
newdf.head(2)

          0         1         2         3         4
0  0.849399  0.122000  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [97]:
newdf[1][0]= "Mayank"

In [98]:
newdf.head(2)

          0         1         2         3         4
0  0.849399    Mayank  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [100]:
print(type(newdf[1][0]))

<class 'str'>

In [101]:
newdf2[1][0]=0.122

c:\users\this pc\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [102]:
newdf.head(2)

          0         1         2         3         4
0  0.849399     0.122  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [106]:
newdf.loc[2,0] = 0.3232  #row , columns

In [107]:
newdf.head(3)

          0          1         2         3         4
0  0.849399      0.122  0.467505  0.665558  0.829985
1  0.122322   0.738085  0.214200  0.797743  0.289570
2  0.323200  0.0800584  0.216104  0.016401  0.186018

In [108]:
newdf.columns = list("ABCDE")

In [109]:
newdf.head(2)

          A         B         C         D         E
0  0.849399     0.122  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [113]:
newdf.columns = ['a','b','c','d','e'] #always pass list

In [114]:
newdf.head(2)

          a         b         c         d         e
0  0.849399     0.122  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [115]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [117]:
newdf.index = np.random.randint(334,size=334)

In [118]:
newdf.index

Int64Index([195, 320,  92, 187,  55, 126, 315,  34,  91, 297,
            ...
            321, 137, 201, 281, 286, 168, 176, 313, 175, 129],
           dtype='int64', length=334)

In [119]:
newdf.head(2)

            a         b         c         d         e
195  0.849399     0.122  0.467505  0.665558  0.829985
320  0.122322  0.738085  0.214200  0.797743  0.289570

In [120]:
newdf.index = np.arange(334)

In [121]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [122]:
newdf.loc[0,'a'] = 0.99999

In [123]:
newdf.head(2)

          a         b         c         d         e
0  0.999990     0.122  0.467505  0.665558  0.829985
1  0.122322  0.738085  0.214200  0.797743  0.289570

In [126]:
newdf.drop('a', axis=1)

             b         c         d         e
0        0.122  0.467505  0.665558  0.829985
1     0.738085  0.214200  0.797743  0.289570
2    0.0800584  0.216104  0.016401  0.186018
3     0.200071  0.725482  0.648755  0.449355
4     0.895077  0.111086  0.994923  0.321657
..         ...       ...       ...       ...
329   0.471347  0.175796  0.512075  0.876464
330   0.233793  0.995780  0.281403  0.932943
331   0.594978  0.673966  0.947385  0.975196
332   0.949431  0.933592  0.205246  0.209453
333   0.067093  0.722584  0.680441  0.851831

[334 rows x 4 columns]

In [127]:
newdf

            a          b         c         d         e
0    0.999990      0.122  0.467505  0.665558  0.829985
1    0.122322   0.738085  0.214200  0.797743  0.289570
2    0.323200  0.0800584  0.216104  0.016401  0.186018
3    0.096152   0.200071  0.725482  0.648755  0.449355
4    0.288567   0.895077  0.111086  0.994923  0.321657
..        ...        ...       ...       ...       ...
329  0.358630   0.471347  0.175796  0.512075  0.876464
330  0.047291   0.233793  0.995780  0.281403  0.932943
331  0.612396   0.594978  0.673966  0.947385  0.975196
332  0.548356   0.949431  0.933592  0.205246  0.209453
333  0.293973   0.067093  0.722584  0.680441  0.851831

[334 rows x 5 columns]

In [128]:
newdf = newdf.drop('a', axis=1)

In [129]:
newdf.head(2)

          b         c         d         e
0     0.122  0.467505  0.665558  0.829985
1  0.738085  0.214200  0.797743  0.289570

In [131]:
newdf = newdf.drop(index = 0 , columns= 'd')

In [132]:
newdf.head(3)

           b         c         e
1   0.738085  0.214200  0.289570
2  0.0800584  0.216104  0.186018
3   0.200071  0.725482  0.449355

In [133]:
newdf.shape

(333, 3)

In [135]:
newdf.index = np.arange(333)
newdf.columns = list('ABC')

In [136]:
newdf.head(3)

           A         B         C
0   0.738085  0.214200  0.289570
1  0.0800584  0.216104  0.186018
2   0.200071  0.725482  0.449355

In [138]:
newdf.loc[[1,2],:]

           A         B         C
1  0.0800584  0.216104  0.186018
2   0.200071  0.725482  0.449355

In [139]:
newdf.loc[:,['B','C']]

            B         C
0    0.214200  0.289570
1    0.216104  0.186018
2    0.725482  0.449355
3    0.111086  0.321657
4    0.876293  0.903602
..        ...       ...
328  0.175796  0.876464
329  0.995780  0.932943
330  0.673966  0.975196
331  0.933592  0.209453
332  0.722584  0.851831

[333 rows x 2 columns]

In [141]:
newdf.loc[5:10,'A':'C']

           A         B         C
5   0.492445  0.544689  0.058614
6   0.384855  0.158764  0.167868
7   0.184514  0.684085  0.177370
8   0.477194  0.621239  0.992706
9   0.002174  0.701682  0.935655
10   0.30938  0.966399  0.438037

In [142]:
newdf.loc[(newdf['A']<0.3)]

             A         B         C
1    0.0800584  0.216104  0.186018
2     0.200071  0.725482  0.449355
7     0.184514  0.684085  0.177370
9     0.002174  0.701682  0.935655
14    0.175704  0.937648  0.982462
..         ...       ...       ...
325  0.0218683  0.755080  0.941934
326   0.275506  0.102290  0.855279
327  0.0376254  0.820108  0.935319
329   0.233793  0.995780  0.932943
332   0.067093  0.722584  0.851831

[102 rows x 3 columns]

In [143]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

             A         B         C
1    0.0800584  0.216104  0.186018
2     0.200071  0.725482  0.449355
7     0.184514  0.684085  0.177370
9     0.002174  0.701682  0.935655
14    0.175704  0.937648  0.982462
..         ...       ...       ...
325  0.0218683  0.755080  0.941934
326   0.275506  0.102290  0.855279
327  0.0376254  0.820108  0.935319
329   0.233793  0.995780  0.932943
332   0.067093  0.722584  0.851831

[92 rows x 3 columns]

In [144]:
newdf.head(5)

           A         B         C
0   0.738085  0.214200  0.289570
1  0.0800584  0.216104  0.186018
2   0.200071  0.725482  0.449355
3   0.895077  0.111086  0.321657
4   0.658433  0.876293  0.903602

In [145]:
newdf.iloc[0,2]

0.28956965259888334

In [146]:
newdf.iloc[[0,2],[0,1]]

          A         B
0  0.738085  0.214200
2  0.200071  0.725482

In [148]:
newdf.iloc[0:2,0:2]

           A         B
0   0.738085  0.214200
1  0.0800584  0.216104

In [149]:
newdf.head(5)

           A         B         C
0   0.738085  0.214200  0.289570
1  0.0800584  0.216104  0.186018
2   0.200071  0.725482  0.449355
3   0.895077  0.111086  0.321657
4   0.658433  0.876293  0.903602

In [151]:
newdf.drop(0 , axis =0)

             A         B         C
1    0.0800584  0.216104  0.186018
2     0.200071  0.725482  0.449355
3     0.895077  0.111086  0.321657
4     0.658433  0.876293  0.903602
5     0.492445  0.544689  0.058614
..         ...       ...       ...
328   0.471347  0.175796  0.876464
329   0.233793  0.995780  0.932943
330   0.594978  0.673966  0.975196
331   0.949431  0.933592  0.209453
332   0.067093  0.722584  0.851831

[332 rows x 3 columns]

In [152]:
newdf.head(5)

           A         B         C
0   0.738085  0.214200  0.289570
1  0.0800584  0.216104  0.186018
2   0.200071  0.725482  0.449355
3   0.895077  0.111086  0.321657
4   0.658433  0.876293  0.903602

In [156]:
newdf.drop('B', axis=1)

             A         C
0     0.738085  0.289570
1    0.0800584  0.186018
2     0.200071  0.449355
3     0.895077  0.321657
4     0.658433  0.903602
..         ...       ...
328   0.471347  0.876464
329   0.233793  0.932943
330   0.594978  0.975196
331   0.949431  0.209453
332   0.067093  0.851831

[333 rows x 2 columns]

In [157]:
newdf.drop('B', axis=1, inplace = True)

In [158]:
newdf.head(5)

           A         C
0   0.738085  0.289570
1  0.0800584  0.186018
2   0.200071  0.449355
3   0.895077  0.321657
4   0.658433  0.903602

In [159]:
newdf.drop([1,4],axis=0 , inplace = True)

In [160]:
newdf.head(5)

          A         C
0  0.738085  0.289570
2  0.200071  0.449355
3  0.895077  0.321657
5  0.492445  0.058614
6  0.384855  0.167868

In [161]:
newdf.shape

(331, 2)

In [170]:
newdf.index = np.arange(331)
newdf.columns = list("AB")

In [171]:
newdf.head(5)

          A         B
0  0.738085  0.289570
1  0.200071  0.449355
2  0.895077  0.321657
3  0.492445  0.058614
4  0.384855  0.167868

In [173]:
newdf.reset_index(drop =True , inplace=True)

In [174]:
newdf.set_index('A',drop=True)

                 B
A
0.738085  0.289570
0.200071  0.449355
0.895077  0.321657
0.492445  0.058614
0.384855  0.167868
...            ...
0.471347  0.876464
0.233793  0.932943
0.594978  0.975196
0.949431  0.209453
0.067093  0.851831

[331 rows x 1 columns]

In [175]:
newdf.head(5)

          A         B
0  0.738085  0.289570
1  0.200071  0.449355
2  0.895077  0.321657
3  0.492445  0.058614
4  0.384855  0.167868

In [176]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
326    False
327    False
328    False
329    False
330    False
Name: B, Length: 331, dtype: bool

In [177]:
newdf['B'] = None

In [178]:
newdf.head(5)

          A     B
0  0.738085  None
1  0.200071  None
2  0.895077  None
3  0.492445  None
4  0.384855  None

In [179]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
326    True
327    True
328    True
329    True
330    True
Name: B, Length: 331, dtype: bool

In [180]:
newdf.head(5)

          A     B
0  0.738085  None
1  0.200071  None
2  0.895077  None
3  0.492445  None
4  0.384855  None

In [183]:
newdf['B'] = np.random.rand(331,1)

In [184]:
newdf.head(5)

          A         B
0  0.738085  0.620077
1  0.200071  0.519739
2  0.895077  0.302390
3  0.492445  0.602342
4  0.384855  0.895666

In [185]:
newdf.loc[:,['A']] = None

In [186]:
newdf.head(5)

      A         B
0  None  0.620077
1  None  0.519739
2  None  0.302390
3  None  0.602342
4  None  0.895666

In [187]:
newdf['A'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
326    True
327    True
328    True
329    True
330    True
Name: A, Length: 331, dtype: bool

In [188]:
newdf.iloc[:,0] = np.random.rand(331,1)

In [189]:
newdf.head(5)

          A         B
0  0.788477  0.620077
1  0.342818  0.519739
2  0.526667  0.302390
3  0.778692  0.602342
4  0.245005  0.895666